<template>
	<view class="content">
		<view id="question" v-text="questions[id - 1].title"></view>
		<view id="hr"></view>
		<view id="answer" v-html="questions[id - 1].text"></view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				id: 0,
				questions: [
					{
						title: "怎么将商品分享给朋友？",
						text: "点击商品进入详情页，点击左下角【分享】，有2种分享方法：<br>1、点击【复制口令】，再在聊天窗口粘贴并发送给好友，好友复制这段消息后打开手机淘宝即可查看和购买；<br>2、点击【保存图片】，图片即可保存到手机相册。将图片发送给好友，好友长按识别二维码，或扫码即可查看和购买。"
					},
					{
						title: "怎么联系客服？",
						text: "首页点击右下角【我的】，进入个人中心，点击【联系客服】，就可以拨打客服热线或联系微信客服/QQ客服了。"
					},
					{
						title: "如何查看淘宝商品是否有优惠券？",
						text: "有3种方法：<br>1、在首页顶部搜索栏，输入你想查券的商品名，点击搜索即可查看；<br>2、在首页顶部搜索栏，粘贴宝贝标题（标题需要打开手机淘宝，进入商品详情页进行复制），点击搜索即可查看；<br>3、如果是APP用户，打开手机淘宝，在商品详情页复制宝贝标题后，打开本APP，就能自动查券啦。<br><br>有券的商品，右下角会显示“XX元券”；你也可以选择“仅显示有优惠券”，那么页面上的商品全都是有优惠券的啦。"
					},
					{
						title: "在哪里查看我下过的订单？",
						text: "进入手机淘宝，点击底部导航栏【我的淘宝】→点击【我的订单】，就可以查看订单啦。"
					},
					{
						title: "如何查看商品物流信息？",
						text: "进入手机淘宝，找到【我的订单】→点击【查看物流】，就可以看你买的宝贝到哪里啦。"
					},
					{
						title: "优惠券的用途是什么？",
						text: "优惠券可抵扣部分现金进行消费。例如，使用30元的优惠券，购买商品时就可以省30元。"
					},
					{
						title: "如何领取优惠券？",
						text: "点击商品进入详情页，点击【立即领券】或【领券购买】，在粉丝福利购页面点击【立即领券】，即领券成功。"
					},
					{
						title: "如何使用优惠券下单？",
						text: "点击商品进入详情页，领券成功后自动跳转至淘宝商品详情页，点击立即购买，下单自动使用优惠券哦。"
					},
					{
						title: "领取优惠券时，为什么提示“券已失效”？",
						text: "有两种情况：①超过了优惠券的领取期限；②优惠券已经领完啦（下次请趁早！）"
					},
					{
						title: "为什么付款价与标注的券后价不一致？",
						text: "有几种可能性哦：<br>1、此款商品不同规格，价格不一样。比如，一个书架标注的券后价为100元，但它有好几个规格，单层书架券后的确为100元，但双层的价格可能会高50元，那么券后价也会相应提高，就成了150元；<br>2、确定看到的是否为最终价格。在淘宝详情页看到的价格是原价，要到下单时才能看到券后价哦；<br>3、唔，淘宝卖家偷偷改价了，我们还没来得及更新…遇到这种情况，可以向我们的客服反馈哦~<br>            "
					},
					{
						title: "怎么收藏商品？怎么查看收藏的商品？",
						text: "点击商品进入详情页，点击左下角【收藏】，即可收藏成功。<br>查看收藏商品，在首页点击右下角【我的】→在【我的收藏】中进行查看。"
					},
					{
						title: "在哪里查看我浏览过的商品？",
						text: "点击底部导航栏【我的】→点击【浏览记录】，便可查看。"
					},
					{
						title: "如何联系商品卖家？ ",
						text: "如果您未购买商品，请点击商品→点击【领券购买】→进入淘宝商品详情页→点击左下角【客服】，就能联系卖家啦。<br>如果您已购买商品，请进入手机淘宝，找到【我的订单】→点击未发货的订单→下拉页面，就会看到联系卖家的入口了。"
					},
					{
						title: "如何申请退换货？",
						text: "进入手机淘宝，找到【我的订单】→点击想退款的订单→点击商品下方的【退换】，就可以操作退货/换货啦。申请退款后，待商品寄回，钱款会原路返回到你的账户中。"
					},
					{
						title: "如何修改收货地址？",
						text: "请联系商品卖家处理哦。进入手机淘宝，找到【我的订单】→点击想修改地址的订单→下拉页面，就会看到联系卖家的入口，请联系卖家修改收货地址哦。"
					},
					{
						title: "商品一直未发货/未收到货怎么办？",
						text: "请联系商品卖家处理哦。进入手机淘宝，找到【我的订单】→点击未发货的订单→下拉页面，就会看到联系卖家的入口，请向卖家咨询商品发货问题哦。"
					},
					{
						title: "商品使用有问题怎么办？",
						text: "请联系商品卖家处理哦。进入手机淘宝，找到【我的订单】→点击商品有问题的订单→下拉页面，就会看到联系卖家的入口，请向卖家咨询商品使用问题哦。"
					},
					{
						title: "购买“第二件0元”的商品，为什么最后只收到1件？",
						text: "请确定自己是否只拍了1件。第二件0元的商品，需要您直接拍2件，第2件自动0元，拍1件就只会发1件哦。请在购买前，仔细阅读卖家的提示。"
					},
					{
						title: "什么样的商品有优惠券？",
						text: "在商品图片的右下角，显示有“XX元券”字样的商品就是有优惠券的商品。"
					},
					{
						title: "领取优惠券时，为什么提示“系统繁忙”？",
						text: "遇到这种情况，请先检查一下自己的网络状况。也可能是遇到了淘宝的神秘bug，请稍候再尝试哦。"
					},
					{
						title: "领取优惠券时，为什么提示“领取已达上限”？",
						text: "每件商品的优惠券数量是有限的，有些是1张，有些是好几张，当领取次数达到上限时，就会出现这个提示。如果换一个账号登录淘宝，就可以领取更多优惠券了哦。"
					},
					{
						title: "优惠券可以和其他优惠叠加吗？",
						text: "根据不同优惠活动的设置，部分可以叠加，部分则只能选择一种优惠使用。<br>告诉你一个小秘密，淘宝的订单确认页面一般会自动叠加最大优惠，试试就知道啦。"
					},
					{
						title: "领取了优惠券但无法使用？",
						text: "有两种情况：①优惠券已经过期了呢。请在优惠期间尽快下单购买哦； ②已经用优惠券下单过了哦。如何确定是否已下单？请在淘宝APP中，通过【我的淘宝】→【待付款】查看你的待付款订单中是否有这个商品。若有，就表示已经用过券啦。"
					}
				]
			}
		},
		onLoad(option) {
			this.id = option.id;
		},
		methods: {
			
		}
	}
</script>

<style>
#question {
	font-size: 30rpx;
	font-weight: bold;
	padding-left: 30rpx;
	line-height: 100rpx;
}

#hr {
	height: 1rpx;
	background-color: #EEEEEE;
}

#answer {
	color: #333333;
	padding: 30rpx;
	font-size: 30rpx;
	line-height: 40rpx;
}
</style>